uliano/brio/brio/stm32f4/device_tables.hpp
/// Register block base of instance n (1..10: USART1, USART2, USART3,
/// UART4, UART5, USART6, UART7, UART8, UART9, UART10 - the family's
/// numbering, the U(S)ART spelling being what usart_is_full() reads), 0
/// when the device does not have it.
constexpr uint32_t usart_base(uint8_t n) {
    switch (n) {
#if defined(USART1_BASE)
        case 1: return USART1_BASE;
#endif
#if defined(USART2_BASE)
        case 2: return USART2_BASE;
#endif
#if defined(USART3_BASE)
        case 3: return USART3_BASE;
#endif
#if defined(UART4_BASE)
        case 4: return UART4_BASE;
#endif
#if defined(UART5_BASE)
        case 5: return UART5_BASE;
#endif
#if defined(USART6_BASE)
        case 6: return USART6_BASE;
#endif
#if defined(UART7_BASE)
        case 7: return UART7_BASE;
#endif
#if defined(UART8_BASE)
        case 8: return UART8_BASE;
#endif
#if defined(UART9_BASE)
        case 9: return UART9_BASE;
#endif
#if defined(UART10_BASE)
        case 10: return UART10_BASE;
#endif
        default: return 0;
    }
}

constexpr bool usart_present(uint8_t n) { return usart_base(n) != 0u; }

/// USART1, USART6 and the F413's UART9/UART10 are APB2's; every other
/// instance is APB1's (RM0090 table 1, the memory map - and the header
/// agrees, by which ENR the enable bit sits in).
constexpr bool usart_on_apb2(uint8_t n) { return n == 1 || n == 6 || n == 9 || n == 10; }

/// A FULL instance has synchronous mode, smartcard and hardware flow
/// control; the UARTs (4, 5, 7, 8, 9, 10) have not (RM0090 table 148,
/// RM0390 table 130, RM0383 table 91 - the same rows on every manual).
constexpr bool usart_is_full(uint8_t n) { return n == 1 || n == 2 || n == 3 || n == 6; }

/// The instance's enable bit in its bus's ENR (RCC_APB1ENR or
/// RCC_APB2ENR by usart_on_apb2); 0 when absent. The same position
/// resets it in the matching RSTR.
constexpr uint32_t usart_clock_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APB2ENR_USART1EN)
        case 1: return RCC_APB2ENR_USART1EN;
#endif
#if defined(RCC_APB1ENR_USART2EN)
        case 2: return RCC_APB1ENR_USART2EN;
#endif
#if defined(RCC_APB1ENR_USART3EN)
        case 3: return RCC_APB1ENR_USART3EN;
#endif
#if defined(RCC_APB1ENR_UART4EN)
        case 4: return RCC_APB1ENR_UART4EN;
#endif
#if defined(RCC_APB1ENR_UART5EN)
        case 5: return RCC_APB1ENR_UART5EN;
#endif
#if defined(RCC_APB2ENR_USART6EN)
        case 6: return RCC_APB2ENR_USART6EN;
#endif
#if defined(RCC_APB1ENR_UART7EN)
        case 7: return RCC_APB1ENR_UART7EN;
#endif
#if defined(RCC_APB1ENR_UART8EN)
        case 8: return RCC_APB1ENR_UART8EN;
#endif
#if defined(RCC_APB2ENR_UART9EN)
        case 9: return RCC_APB2ENR_UART9EN;
#endif
#if defined(RCC_APB2ENR_UART10EN)
        case 10: return RCC_APB2ENR_UART10EN;
#endif
        default: return 0;
    }
}

/// The instance's NVIC line. Every serial instance of this family has a
/// line of its own (no sharing), so the enumerator's name is the
/// instance's; the guard is the instance's presence.
constexpr IRQn_Type usart_irq(uint8_t n) {
    switch (n) {
#if defined(USART1_BASE)
        case 1: return USART1_IRQn;
#endif
#if defined(USART2_BASE)
        case 2: return USART2_IRQn;
#endif
#if defined(USART3_BASE)
        case 3: return USART3_IRQn;
#endif
#if defined(UART4_BASE)
        case 4: return UART4_IRQn;
#endif
#if defined(UART5_BASE)
        case 5: return UART5_IRQn;
#endif
#if defined(USART6_BASE)
        case 6: return USART6_IRQn;
#endif
#if defined(UART7_BASE)
        case 7: return UART7_IRQn;
#endif
#if defined(UART8_BASE)
        case 8: return UART8_IRQn;
#endif
#if defined(UART9_BASE)
        case 9: return UART9_IRQn;
#endif
#if defined(UART10_BASE)
        case 10: return UART10_IRQn;
#endif
        default: return NonMaskableInt_IRQn;   // unreachable: callers check usart_present first
    }
}

// ---- the regulator and the clock ladders --------------------------------------

/// Whether PWR_CR carries the over-drive pair (ODEN, ODSWEN) - the
/// F42x/F43x, F446 and F469/F479 classes.
constexpr bool pwr_has_over_drive() {
#if defined(PWR_CR_ODEN)
    return true;
#else
    return false;
#endif
}

/// Whether VOS is a two-bit field (scales 3, 2, 1) or the F405 class's
/// single bit (scales 2, 1).
constexpr bool pwr_vos_two_bits() {
#if defined(PWR_CR_VOS_1)
    return true;
#else
    return false;
#endif
}

/// What a part class may run at, in Hz, at 2.7..3.6 V - the reference
/// manual's numbers, keyed on the device-select define (see the file
/// header for why this one table is a table).
struct SysclkLadder {
    bool known = false;
    uint32_t scale3_hz = 0;      ///< HCLK ceiling at regulator scale 3 (0 on a one-bit VOS)
    uint32_t scale2_hz = 0;      ///< ... at scale 2
    uint32_t scale1_hz = 0;      ///< ... at scale 1
    uint32_t od_scale2_hz = 0;   ///< scale 2 with over-drive (0 where there is none)
    uint32_t od_scale1_hz = 0;   ///< scale 1 with over-drive
    uint32_t apb1_max_hz = 0;    ///< PCLK1 ceiling (RCC_CFGR.PPRE1's caution)
    uint32_t apb2_max_hz = 0;    ///< PCLK2 ceiling (PPRE2's)
    uint8_t ws_bands = 0;        ///< how many rows of ws_ceiling_hz are used
    uint32_t ws_ceiling_hz[9] = {};   ///< HCLK ceiling for 0, 1, 2, ... wait states
};

constexpr SysclkLadder sysclk_ladder() {
    SysclkLadder l{};
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx)
    // RM0090 5.4.1 (one VOS bit: scale 2 up to 144 MHz, scale 1 up to
    // 168 MHz), 6.3.3 (PPRE1 42 MHz, PPRE2 84 MHz), 3.5.1 table 11.
    l.known = true;
    l.scale2_hz = 144'000'000u;
    l.scale1_hz = 168'000'000u;
    l.apb1_max_hz = 42'000'000u;
    l.apb2_max_hz = 84'000'000u;
    l.ws_bands = 6;
    l.ws_ceiling_hz[0] = 30'000'000u;  l.ws_ceiling_hz[1] = 60'000'000u;  l.ws_ceiling_hz[2] = 90'000'000u;
    l.ws_ceiling_hz[3] = 120'000'000u; l.ws_ceiling_hz[4] = 150'000'000u; l.ws_ceiling_hz[5] = 168'000'000u;
#elif defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F446xx)
    // RM0090 5.1.4 / RM0390 5.1.4 (scale 3 up to 120, scale 2 up to
    // 144 - 168 in over-drive -, scale 1 up to 168 - 180 in over-drive),
    // 7.3.3 (PPRE1 45 MHz, PPRE2 90 MHz), 3.5.1 table 12 / RM0390 table 5.
    l.known = true;
    l.scale3_hz = 120'000'000u;
    l.scale2_hz = 144'000'000u;
    l.scale1_hz = 168'000'000u;
    l.od_scale2_hz = 168'000'000u;
    l.od_scale1_hz = 180'000'000u;
    l.apb1_max_hz = 45'000'000u;
    l.apb2_max_hz = 90'000'000u;
    l.ws_bands = 6;
    l.ws_ceiling_hz[0] = 30'000'000u;  l.ws_ceiling_hz[1] = 60'000'000u;  l.ws_ceiling_hz[2] = 90'000'000u;
    l.ws_ceiling_hz[3] = 120'000'000u; l.ws_ceiling_hz[4] = 150'000'000u; l.ws_ceiling_hz[5] = 180'000'000u;
#elif defined(STM32F411xE)
    // RM0383 5.1.4 (scale 3 up to 64, scale 2 up to 84, scale 1 up to
    // 100 MHz, no over-drive), 6.3.3 (PPRE1 50 MHz, PPRE2 100 MHz),
    // 3.4.1 table 5.
    l.known = true;
    l.scale3_hz = 64'000'000u;
    l.scale2_hz = 84'000'000u;
    l.scale1_hz = 100'000'000u;
    l.apb1_max_hz = 50'000'000u;
    l.apb2_max_hz = 100'000'000u;
    l.ws_bands = 4;
    l.ws_ceiling_hz[0] = 30'000'000u; l.ws_ceiling_hz[1] = 64'000'000u;
    l.ws_ceiling_hz[2] = 90'000'000u; l.ws_ceiling_hz[3] = 100'000'000u;
#endif
    return l;
}

/// The highest HCLK this part may run at, over-drive included; 0 when
/// the ladder is not known.
constexpr uint32_t sysclk_max_hz() {
    constexpr SysclkLadder l = sysclk_ladder();
    if (!l.known) {
        return 0;
    }
    return l.od_scale1_hz != 0u ? l.od_scale1_hz : l.scale1_hz;
}

/// Wait states for `hclk` at 2.7..3.6 V; 0xFF when the ladder is not
/// known or the rate is above its last band.
constexpr uint8_t flash_wait_states_for(uint32_t hclk) {
    constexpr SysclkLadder l = sysclk_ladder();
    if (!l.known) {
        return 0xFF;
    }
    for (uint8_t ws = 0; ws < l.ws_bands; ++ws) {
        if (hclk <= l.ws_ceiling_hz[ws]) {
            return ws;
        }
    }
    return 0xFF;
}

/// The unique device ID's 96 bits (RM0090 39.1, RM0390 34.1, RM0383
/// 24.1), the flash size register and the package register - memory-
/// mapped system memory, at the addresses the header states.
inline constexpr uint32_t device_uid_base = UID_BASE;
inline constexpr uint32_t flash_size_register = FLASHSIZE_BASE;
inline constexpr uint32_t package_register = PACKAGE_BASE;

// ---- reset and watchdogs ------------------------------------------------------

/// Whether the independent watchdog has a WINDOW register (IWDG_WINR and
/// its WVU update bit). NO header of this pack declares one - the F4's
/// IWDG is four registers and an early refresh is not a reset here - and
/// stm32f4/reset.hpp offers no window verb because of it. The probe is
/// what makes that a checked fact rather than a claim.
constexpr bool iwdg_has_window() {
#if defined(IWDG_WINR_WIN)
    return true;
#else
    return false;
#endif
}

/// How many codes the window watchdog's prescaler field holds: FOUR on
/// this family (WDGTB is two bits, /1 to /8), read off the header's own
/// mask rather than counted by hand.
constexpr uint8_t wwdg_prescaler_codes() {
    return static_cast<uint8_t>((WWDG_CFR_WDGTB_Msk >> WWDG_CFR_WDGTB_Pos) + 1u);
}

/// Whether this device has the window watchdog at all (every part of the
/// pack does; the probe is the reserve's habit, not a doubt).
constexpr bool wwdg_present() {
#if defined(WWDG_BASE)
    return true;
#else
    return false;
#endif
}

/// The window watchdog's NVIC line - position 0 of the vector table on
/// every part of this family, and its alone. An IRQn is an enumerator
/// the preprocessor cannot probe, so the guard is the instance's
/// base-address macro, as it is for the serial instances above.
constexpr IRQn_Type wwdg_irq() {
#if defined(WWDG_BASE)
    return WWDG_IRQn;
#else
    return NonMaskableInt_IRQn;   // unreachable: callers check wwdg_present first
#endif
}

