uliano/brio/brio/stm32f4/device_tables.hpp
/// The largest ARR / CNT / CCR this counter holds.
constexpr uint32_t tim_max_period(uint8_t n) {
    const uint8_t bits = tim_counter_bits(n);
    return bits == 32u ? 0xFFFFFFFFUL : (bits == 16u ? 0xFFFFUL : 0UL);
}

/// Capture/compare channels: four on TIM1/TIM8 and TIM2..TIM5, two on
/// TIM9/TIM12, one on TIM10/TIM11/TIM13/TIM14, none at all on the basic
/// TIM6/TIM7 (each chapter's ".2 main features").
constexpr uint8_t tim_channels(uint8_t n) {
    if (!tim_present(n)) {
        return 0;
    }
    switch (n) {
        case 1: case 2: case 3: case 4: case 5: case 8: return 4;
        case 9: case 12: return 2;
        case 10: case 11: case 13: case 14: return 1;
        default: return 0;   // TIM6, TIM7
    }
}

/// Complementary outputs (CCxNE, and the OISxN idle levels): channels
/// 1..3 of the two advanced-control timers and nowhere else (RM0090 17.2).
constexpr uint8_t tim_complementary_channels(uint8_t n) {
    if (!tim_present(n)) {
        return 0;
    }
    return (n == 1u || n == 8u) ? 3u : 0u;
}

/// TIMx_SMCR - a slave controller at all. TIM10/TIM11/TIM13/TIM14 have no
/// such register and the basic timers have none either.
constexpr bool tim_has_slave_mode(uint8_t n) {
    if (!tim_present(n)) {
        return false;
    }
    switch (n) {
        case 1: case 2: case 3: case 4: case 5: case 8: case 9: case 12: return true;
        default: return false;
    }
}

/// SMS's encoder codes 001..011, which are RESERVED on TIM9/TIM12
/// (RM0383 14.4.2) - so only the four-channel timers count a quadrature
/// pair.
constexpr bool tim_has_encoder(uint8_t n) {
    if (!tim_present(n)) {
        return false;
    }
    switch (n) {
        case 1: case 2: case 3: case 4: case 5: case 8: return true;
        default: return false;
    }
}

/// TIMx_CR2 and its MMS field - TRGO. TIM9..TIM14 have NO CR2 at all
/// (their register maps jump from CR1 to SMCR), so they can drive no
/// slave; the basic timers have one with MMS alone.
constexpr bool tim_has_master_mode(uint8_t n) {
    if (!tim_present(n)) {
        return false;
    }
    switch (n) {
        case 1: case 2: case 3: case 4: case 5: case 6: case 7: case 8: return true;
        default: return false;
    }
}

/// TIMx_BDTR: the break input and the dead-time generator, the two
/// advanced-control timers' alone.
constexpr bool tim_has_break(uint8_t n) { return tim_complementary_channels(n) != 0u; }

/// TIMx_RCR, the repetition counter - the same two.
constexpr bool tim_has_repetition(uint8_t n) { return tim_has_break(n); }

/// CR1.DIR and CR1.CMS: down-counting and centre-aligned counting, on the
/// four-channel timers alone (TIM9..TIM14 count up, the basic timers too).
constexpr bool tim_has_direction(uint8_t n) { return tim_has_encoder(n); }
constexpr bool tim_has_center_aligned(uint8_t n) { return tim_has_encoder(n); }

/// CR1.CKD, the tDTS divider the input filters and the dead-time generator
/// are counted in: every timer with a channel, and not the basic pair.
constexpr bool tim_has_clock_division(uint8_t n) {
    return tim_present(n) && tim_channels(n) != 0u;
}

/// The ETR input and SMCR's ETF/ETPS/ECE/ETP half (external clock mode 2):
/// the four-channel timers alone. CCMRx's OCxCE (clear the output on
/// ocref_clr) is the same set, ocref_clr being ETRF.
constexpr bool tim_has_external_trigger(uint8_t n) { return tim_has_encoder(n); }

/// CR2.TI1S, the XOR of the first three channel inputs on TI1 (RM0090
/// 17.3.17): the four-channel timers'.
constexpr bool tim_has_ti1_xor(uint8_t n) { return tim_has_encoder(n); }

/// DIER's UDE/TDE/CCxDE request enables. TIM9..TIM14 have no DMA of any
/// kind (their DIER is four bits wide); the basic timers have UDE alone.
constexpr bool tim_has_dma_request(uint8_t n) {
    return tim_present(n) && n <= 8u;
}

/// TIMx_DCR and TIMx_DMAR, the burst engine that turns ONE request into a
/// walk over consecutive registers: the four-channel timers'. The basic
/// timers' register map stops at ARR.
constexpr bool tim_has_dma_burst(uint8_t n) { return tim_has_encoder(n); }

/// TIMx_OR, the option register - the input and trigger remaps that make
/// this chapter measurable with no wire. Only TIM2 (ITR1_RMP), TIM5
/// (TI4_RMP) and TIM11 (TI1_RMP) have one (RM0090 18.4.19, 18.4.20,
/// 19.5.11).
constexpr bool tim_has_option_register(uint8_t n) {
    return tim_present(n) && (n == 2u || n == 5u || n == 11u);
}

/// Where that instance's field sits in TIMx_OR, 0xFF for an instance with
/// no option register. The three positions are the header's own *_Pos
/// macros, and the pack declares each only where the instance it belongs
/// to exists - TIM_OR_ITR1_RMP_Pos is absent on exactly the three F410
/// headers, which are exactly the parts with no TIM2.
constexpr uint8_t tim_option_pos(uint8_t n) {
    if (!tim_present(n)) {
        return 0xFFu;
    }
    switch (n) {
#if defined(TIM_OR_ITR1_RMP_Pos)
        case 2: return TIM_OR_ITR1_RMP_Pos;
#endif
#if defined(TIM_OR_TI4_RMP_Pos)
        case 5: return TIM_OR_TI4_RMP_Pos;
#endif
#if defined(TIM_OR_TI1_RMP_Pos)
        case 11: return TIM_OR_TI1_RMP_Pos;
#endif
        default: return 0xFFu;
    }
}

/// THE VECTORS. On this family the two advanced-control timers have FOUR
/// lines each - break, update, trigger/commutation, capture/compare - and
/// three of the four are SHARED with a small general-purpose timer
/// (TIM1_BRK_TIM9, TIM1_UP_TIM10, TIM1_TRG_COM_TIM11 and the TIM8 twins
/// with TIM12, TIM13, TIM14). Every other timer reports everything on one
/// line of its own, except TIM6, which shares with the DAC where there is
/// one. IRQn values are enumerators the preprocessor cannot probe, so each
/// name is DERIVED FROM THE PRESENCE of what shares it, exactly as
/// usart_irq() and exti_line_irq() are.
///
/// tim_irq() is where the UPDATE event arrives, which is the line a timer
/// with one vector answers everything on. NonMaskableInt_IRQn for a timer
/// the device has not got - unreachable, Tim<n> refusing it first.
constexpr IRQn_Type tim_irq(uint8_t n) {
    switch (n) {
        case 1:
#if defined(TIM10_BASE)
            return TIM1_UP_TIM10_IRQn;
#else
            return TIM1_UP_IRQn;
#endif
#if defined(TIM2_BASE)
        case 2: return TIM2_IRQn;
#endif
#if defined(TIM3_BASE)
        case 3: return TIM3_IRQn;
#endif
#if defined(TIM4_BASE)
        case 4: return TIM4_IRQn;
#endif
#if defined(TIM5_BASE)
        case 5: return TIM5_IRQn;
#endif
#if defined(TIM6_BASE) && defined(DAC_BASE)
        case 6: return TIM6_DAC_IRQn;
#elif defined(TIM6_BASE)
        case 6: return TIM6_IRQn;
#endif
#if defined(TIM7_BASE)
        case 7: return TIM7_IRQn;
#endif
#if defined(TIM8_BASE)
        case 8: return TIM8_UP_TIM13_IRQn;
#endif
#if defined(TIM9_BASE)
        case 9: return TIM1_BRK_TIM9_IRQn;
#endif
#if defined(TIM10_BASE)
        case 10: return TIM1_UP_TIM10_IRQn;
#endif
#if defined(TIM11_BASE)
        case 11: return TIM1_TRG_COM_TIM11_IRQn;
#endif
#if defined(TIM12_BASE)
        case 12: return TIM8_BRK_TIM12_IRQn;
#endif
#if defined(TIM13_BASE)
        case 13: return TIM8_UP_TIM13_IRQn;
#endif
#if defined(TIM14_BASE)
        case 14: return TIM8_TRG_COM_TIM14_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// The capture/compare line: its own on the advanced-control timers,
/// tim_irq() everywhere else - which is what lets a handler bind both
/// without asking whether they are two.
constexpr IRQn_Type tim_cc_irq(uint8_t n) {
    switch (n) {
        case 1: return TIM1_CC_IRQn;
#if defined(TIM8_BASE)
        case 8: return TIM8_CC_IRQn;
#endif
        default: return tim_irq(n);
    }
}

