uliano/brio/brio/stm32f4/device_tables.hpp
constexpr bool spi_present(uint8_t n) { return spi_base(n) != 0u; }

/// The APB2 instances are SPI1, SPI4, SPI5 and SPI6; SPI2 and SPI3 are on
/// APB1. Asked of the enable bit's own register, so the answer comes from
/// the header and not from a rule written down twice.
constexpr bool spi_on_apb2(uint8_t n) {
    switch (n) {
#if defined(RCC_APB2ENR_SPI1EN)
        case 1: return true;
#endif
#if defined(RCC_APB2ENR_SPI4EN)
        case 4: return true;
#endif
#if defined(RCC_APB2ENR_SPI5EN)
        case 5: return true;
#endif
#if defined(RCC_APB2ENR_SPI6EN)
        case 6: return true;
#endif
        default: return false;
    }
}

/// The instance's enable bit; the same position resets it in the bus's
/// RCC_APBxRSTR.
constexpr uint32_t spi_clock_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APB2ENR_SPI1EN)
        case 1: return RCC_APB2ENR_SPI1EN;
#endif
#if defined(RCC_APB1ENR_SPI2EN)
        case 2: return RCC_APB1ENR_SPI2EN;
#endif
#if defined(RCC_APB1ENR_SPI3EN)
        case 3: return RCC_APB1ENR_SPI3EN;
#endif
#if defined(RCC_APB2ENR_SPI4EN)
        case 4: return RCC_APB2ENR_SPI4EN;
#endif
#if defined(RCC_APB2ENR_SPI5EN)
        case 5: return RCC_APB2ENR_SPI5EN;
#endif
#if defined(RCC_APB2ENR_SPI6EN)
        case 6: return RCC_APB2ENR_SPI6EN;
#endif
        default: return 0;
    }
}

/// ONE VECTOR PER INSTANCE. An IRQn is an enumerator the preprocessor
/// cannot probe, so each is guarded by its instance's base macro.
constexpr IRQn_Type spi_irq(uint8_t n) {
    switch (n) {
#if defined(SPI1_BASE)
        case 1: return SPI1_IRQn;
#endif
#if defined(SPI2_BASE)
        case 2: return SPI2_IRQn;
#endif
#if defined(SPI3_BASE)
        case 3: return SPI3_IRQn;
#endif
#if defined(SPI4_BASE)
        case 4: return SPI4_IRQn;
#endif
#if defined(SPI5_BASE)
        case 5: return SPI5_IRQn;
#endif
#if defined(SPI6_BASE)
        case 6: return SPI6_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

/// The full-duplex I2S extension blocks (RM0090 28.4.2): a second, always
/// SLAVE, register block sharing SPI2's or SPI3's clock and word select.
/// Absent where the header declares no base - the F446 is the part class
/// that has none and pairs two whole instances instead (RM0390 26.6.2).
constexpr uint32_t i2s_ext_base(uint8_t n) {
    switch (n) {
#if defined(I2S2ext_BASE)
        case 2: return I2S2ext_BASE;
#endif
#if defined(I2S3ext_BASE)
        case 3: return I2S3ext_BASE;
#endif
        default: return 0;
    }
}

constexpr bool i2s_ext_present(uint8_t n) { return i2s_ext_base(n) != 0u; }

/// How this part selects the I2S kernel clock.
enum class I2sClockSelect : uint8_t {
    none,          ///< no selector at all
    cfgr,          ///< RCC_CFGR.I2SSRC: one bit, PLLI2S_R or the I2S_CKIN pad
    dckcfgr_one,   ///< RCC_DCKCFGR.I2SSRC: two bits, on a part with no PLLI2S
    dckcfgr_pair,  ///< RCC_DCKCFGR's I2S1SRC and I2S2SRC: two bits EACH, and
                   ///< the numbering is BY APB BUS and not by instance -
                   ///< I2S1SRC is the APB1 instances', I2S2SRC the APB2 ones'
                   ///< (RM0390 6.3.24). A trap the names invite.
};

constexpr I2sClockSelect i2s_clock_select() {
#if defined(RCC_DCKCFGR_I2S1SRC)
    return I2sClockSelect::dckcfgr_pair;
#elif defined(RCC_DCKCFGR_I2SSRC)
    return I2sClockSelect::dckcfgr_one;
#elif defined(RCC_CFGR_I2SSRC)
    return I2sClockSelect::cfgr;
#else
    return I2sClockSelect::none;
#endif
}

/// Whether this part has the dedicated audio PLL at all (the F410 class
/// has not, and selects its I2S clock between the main PLL and the pad).
constexpr bool plli2s_present() {
#if defined(RCC_CR_PLLI2SON)
    return true;
#else
    return false;
#endif
}

/// Whether PLLI2SCFGR carries its OWN input divider: where it does not,
/// the audio PLL divides the MAIN PLL's M (RM0090 7.3.23).
constexpr bool plli2s_has_m() {
#if defined(RCC_PLLI2SCFGR_PLLI2SM_Pos)
    return true;
#else
    return false;
#endif
}

/**
 * WHICH INSTANCES WEAR THE I2S FACE, and the extension blocks, per part
 * class - the manuals' memory maps:
 *  - the F405 class and the F42x/F43x class: I2S2 and I2S3 alone
 *    (RM0090 28.2.2, "Both I2S (I2S2 and I2S3)"), with I2S2ext/I2S3ext;
 *  - the F411: SPI1/I2S1 through SPI5/I2S5, every instance (RM0383 2.3);
 *  - the F446: I2S2 and I2S3 (RM0390 2.3 names SPI1 and SPI4 with no I2S),
 *    and NO extension block - full duplex there is two instances paired.
 * A class whose manual was not read answers `known` false, and
 * stm32f4/spi.hpp refuses `I2s<n>` on it rather than guess.
 */
struct SpiI2sFacts {
    bool known = false;
    uint8_t instances = 0;      ///< bit n-1 set: instance n has the I2S face
    bool ext_blocks = false;    ///< I2S2ext / I2S3ext exist on this class
};

constexpr SpiI2sFacts spi_i2s_facts() {
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx) || \
    defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx)
    return SpiI2sFacts{true, 0x06u, true};    // SPI2, SPI3
#elif defined(STM32F411xE)
    return SpiI2sFacts{true, 0x1Fu, true};    // SPI1..SPI5
#elif defined(STM32F446xx)
    return SpiI2sFacts{true, 0x06u, false};   // SPI2, SPI3; no extension block
#else
    return SpiI2sFacts{};
#endif
}

constexpr bool spi_i2s_capable(uint8_t n) {
    const SpiI2sFacts f = spi_i2s_facts();
    return f.known && n >= 1u && n <= 6u && (f.instances & (1u << (n - 1u))) != 0u;
}

/**
 * WHERE AN SPI INSTANCE'S DMA REQUESTS SIT - the SPI slice of the request
 * mapping (RM0090 tables 43 and 44, RM0390 tables 28 and 29, RM0383
 * tables 27 and 28), keyed on the part class for the reason the serial
 * slice is: no device header carries a request mapping, and the tables
 * differ by part.
 *
 * UP TO THREE CELLS, where the serial and analog slices need two: the
 * F411's table gives SPI1_TX, SPI4_RX and SPI5_TX three cells each (DMA2
 * stream 2 channel 2 for SPI1_TX, stream 4 channel 4 for SPI4_RX, stream
 * 5 channel 5 for SPI5_TX are the extra ones no other manual shows) - the
 * shared `DmaPlacements` list is three wide for their sake.
 */

constexpr DmaPlacements spi_dma_placements(uint8_t n, bool transmit) {
    DmaPlacements p{};
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || \
    defined(STM32F417xx) || defined(STM32F427xx) || defined(STM32F437xx) || \
    defined(STM32F429xx) || defined(STM32F439xx) || defined(STM32F446xx) || \
    defined(STM32F411xE)
    p.known = true;
    if (!spi_present(n)) {
        return p;   // the class's table is read, this part has no such instance
    }
    switch (n) {
        case 1:
            if (transmit) {
                p.count = 2;
                p.at[0] = {2, 3, 3};
                p.at[1] = {2, 5, 3};
#if defined(STM32F411xE)
                // RM0383 table 28, channel 2 stream 2 - the F411's alone.
                p.count = 3;
                p.at[2] = {2, 2, 2};
#endif
            } else {
                p.count = 2;
                p.at[0] = {2, 0, 3};
                p.at[1] = {2, 2, 3};
            }
            break;
        case 2:
            p.count = 1;
            p.at[0] = transmit ? DmaPlacement{1, 4, 0} : DmaPlacement{1, 3, 0};
            break;
        case 3:
            p.count = 2;
            if (transmit) { p.at[0] = {1, 5, 0}; p.at[1] = {1, 7, 0}; }
            else          { p.at[0] = {1, 0, 0}; p.at[1] = {1, 2, 0}; }
            break;
        case 4:
            if (transmit) {
                p.count = 2;
                p.at[0] = {2, 1, 4};
                p.at[1] = {2, 4, 5};
            } else {
                p.count = 2;
                p.at[0] = {2, 0, 4};
                p.at[1] = {2, 3, 5};
#if defined(STM32F411xE)
                // RM0383 table 28, channel 4 stream 4 - the F411's alone.
                p.count = 3;
                p.at[2] = {2, 4, 4};
#endif
            }
            break;
        case 5:
            if (transmit) {
                p.count = 2;
                p.at[0] = {2, 4, 2};
                p.at[1] = {2, 6, 7};
#if defined(STM32F411xE)
                // RM0383 table 28, channel 5 stream 5 - the F411's alone.
                p.count = 3;
                p.at[2] = {2, 5, 5};
#endif
            } else {
                p.count = 2;
                p.at[0] = {2, 3, 2};
                p.at[1] = {2, 5, 7};
            }
            break;
        case 6:
            p.count = 1;
            p.at[0] = transmit ? DmaPlacement{2, 5, 1} : DmaPlacement{2, 6, 1};
            break;
        default: break;
    }
#else
    (void)n;
    (void)transmit;
#endif
    return p;
}

/// Whether (controller, stream, channel) is a cell instance `n`'s request
/// is wired to. False on a part whose table was not read, and false for an
/// instance the read table has no row for - both refusals, never a guess.
constexpr bool spi_dma_placement_valid(uint8_t n, bool transmit, uint8_t controller,
                                       uint8_t stream, uint8_t channel) {
    const DmaPlacements p = spi_dma_placements(n, transmit);
    if (!p.known) {
        return false;
    }
    for (uint8_t i = 0; i < p.count; ++i) {
        if (p.at[i].controller == controller && p.at[i].stream == stream &&
            p.at[i].channel == channel) {
            return true;
        }
    }
    return false;
}

// ---- the USB OTG controllers ----------------------------------------------------
//
// This family carries up to TWO instances of the same Synopsys DWC2 core:
// OTG_FS, whose PHY is full speed and on chip, and OTG_HS, which drives a
// ULPI transceiver at high speed and ALSO has a full-speed PHY of its own
// (RM0090 34 and 35, RM0390 31 and 32, RM0383 22). Seen from device mode
// at full speed the two are one programmer's model at two base addresses,
// which is why the driver is one template over the core below and not two
// drivers. What differs is a handful of facts, and the header carries
// most of them.
//
// WHAT THE HEADER ANSWERS: whether the part has each core at all (the
// F410 has neither, the F401/F411/F412/F413 have the FS core alone, the
// F405 class, the F42x/F43x, the F446 and the F469/F479 have both), the
// base addresses, the bus each one's gate sits on, and which of the three
// GCCFG generations the part has - the one thing about VBUS a program
// must know to free the pad.
//
// WHAT THE MANUALS ANSWER, and is therefore stated here as a constant per
// CORE with its section: the FIFO RAM (1.25 Kbyte on the FS core, 4 Kbyte
// on the HS one - RM0383 22.2.1, RM0090 35.2.1) and how many device
// endpoint numbers the core instantiates. The counts below are the ones
// every manual on the desk states for its core (RM0383 22.2.3, RM0090
// 34.2.3 and 35.2.3, RM0390 31.2.3): four bidirectional numbers on the FS
// core - endpoint zero and three more - and six on the HS one. A part
// class whose manual was not read may bond more; taking the number the
// read manuals agree on can only leave an endpoint unused, never invent
// one.
//
// THE PADS are the datasheets' (DS10314 table 9, DS10693 table 11, the
// F429's table 12) and are fixed: the FS PHY is bonded to PA11 and PA12
// at AF10, the HS core's own full-speed PHY to PB14 and PB15 at AF12.

/// The two OTG cores of this family, as the manuals name them.
enum class OtgCore : uint8_t { fs, hs };

/// How this part's GCCFG says "there is no VBUS pad, take VBUS as valid".
/// The register was respun twice inside the family and the device header
/// is the authority on which one a part has:
///  - `no_vbus_sense`: the first layout (VBUSASEN / VBUSBSEN / SOFOUTEN /
///    NOVBUSSENS), on the F401, F405 class, F411 and F42x/F43x. Setting
///    NOVBUSSENS frees the pad.
///  - `vbus_detect`: the later one (PWRDWN and VBDEN alone, the F446 and
///    F469/F479; the F412/F413 add the battery-charging detector to it).
///    Clearing VBDEN frees the pad, and the session-valid OVERRIDE pair
///    in GOTGCTL is what then tells the core a session is on.
///  - `none`: the part has no OTG core.
enum class OtgVbusStyle : uint8_t { none, no_vbus_sense, vbus_detect };

/// Everything a driver needs to reach one core, or `present == false`.
struct OtgFacts {
    bool present = false;
    uint32_t base = 0;
    bool gate_on_ahb1 = false;   ///< the FS core's gate is on AHB2, the HS core's on AHB1
    uint32_t clock_mask = 0;
    uint32_t reset_mask = 0;
    uint32_t ulpi_clock_mask = 0;   ///< the HS core's ULPI clock gate, left CLOSED on the embedded PHY
    uint16_t fifo_words = 0;        ///< the dedicated FIFO RAM, in 32-bit words
    uint8_t endpoints = 0;          ///< device endpoint NUMBERS, endpoint zero counted
    bool phy_select_writable = false;   ///< GUSBCFG.PHYSEL: read-only 1 on the FS core, written on the HS one
    char dm_port = 0;
    uint8_t dm_pin = 0;
    char dp_port = 0;
    uint8_t dp_pin = 0;
    uint8_t pad_function = 0;   ///< the AF number both pads take
};

constexpr OtgFacts otg_facts(OtgCore core) {
    if (core == OtgCore::fs) {
#if defined(USB_OTG_FS_PERIPH_BASE)
        return OtgFacts{true,
                        USB_OTG_FS_PERIPH_BASE,
                        false,
                        RCC_AHB2ENR_OTGFSEN,
                        RCC_AHB2RSTR_OTGFSRST,
                        0,
                        320,
                        4,
                        false,
                        'A', 11, 'A', 12, 10};
#else
        return OtgFacts{};
#endif
    }
#if defined(USB_OTG_HS_PERIPH_BASE)
    return OtgFacts{true,
                    USB_OTG_HS_PERIPH_BASE,
                    true,
                    RCC_AHB1ENR_OTGHSEN,
                    RCC_AHB1RSTR_OTGHRST,
                    RCC_AHB1ENR_OTGHSULPIEN,
                    1024,
                    6,
                    true,
                    'B', 14, 'B', 15, 12};
#else
    return OtgFacts{};
#endif
}

constexpr bool otg_present(OtgCore core) { return otg_facts(core).present; }

/// The core's global interrupt line. NonMaskableInt_IRQn where the part
/// has no such core - the enumerators are not preprocessor-visible, so
/// every arm of this switch is guarded by the instance's base macro, as
/// everywhere else in this file.
constexpr IRQn_Type otg_irq(OtgCore core) {
    if (core == OtgCore::fs) {
#if defined(USB_OTG_FS_PERIPH_BASE)
        return OTG_FS_IRQn;
#else
        return NonMaskableInt_IRQn;
#endif
    }
#if defined(USB_OTG_HS_PERIPH_BASE)
    return OTG_HS_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

