uliano/brio/brio/stm32f4/device_tables.hpp
/// The core's wake-up line through the EXTI (line 18 for the FS core,
/// line 20 for the HS one - exti_line_irq() answers the same vector).
constexpr IRQn_Type otg_wakeup_irq(OtgCore core) {
    if (core == OtgCore::fs) {
#if defined(USB_OTG_FS_PERIPH_BASE)
        return OTG_FS_WKUP_IRQn;
#else
        return NonMaskableInt_IRQn;
#endif
    }
#if defined(USB_OTG_HS_PERIPH_BASE)
    return OTG_HS_WKUP_IRQn;
#else
    return NonMaskableInt_IRQn;
#endif
}

constexpr uint32_t otg_wakeup_exti_line(OtgCore core) { return core == OtgCore::fs ? 18u : 20u; }

/// Which GCCFG layout this part has. The three generations are told apart
/// by the bit names the header declares and by nothing else.
constexpr OtgVbusStyle otg_vbus_style() {
#if defined(USB_OTG_GCCFG_NOVBUSSENS)
    return OtgVbusStyle::no_vbus_sense;
#elif defined(USB_OTG_GCCFG_VBDEN)
    return OtgVbusStyle::vbus_detect;
#else
    return OtgVbusStyle::none;
#endif
}

/// Whether GOTGCTL carries the B-session-valid OVERRIDE pair (BVALOEN and
/// BVALOVAL), which is how a part of the later generation is told a
/// session is on with the VBUS pad given away.
constexpr bool otg_has_session_override() {
#if defined(USB_OTG_GOTGCTL_BVALOEN)
    return true;
#else
    return false;
#endif
}

/// The two GOTGCTL bits that force B-session-valid, or 0 where the part
/// has no such override.
constexpr uint32_t otg_session_override_bits() {
#if defined(USB_OTG_GOTGCTL_BVALOEN)
    return USB_OTG_GOTGCTL_BVALOEN | USB_OTG_GOTGCTL_BVALOVAL;
#else
    return 0;
#endif
}

/// GOTGCTL's "a B-session is valid" status bit. The two GCCFG generations
/// brought two SPELLINGS of the same bit (BSVLD and BSESVLD) at the same
/// position, so the name is a fact of the header and not of the silicon.
constexpr uint32_t otg_session_valid_bit() {
#if defined(USB_OTG_GOTGCTL_BSVLD)
    return USB_OTG_GOTGCTL_BSVLD;
#elif defined(USB_OTG_GOTGCTL_BSESVLD)
    return USB_OTG_GOTGCTL_BSESVLD;
#else
    return 0;
#endif
}

/// The whole GCCFG value a DEVICE wants: the transceiver powered up, and
/// either the VBUS pad given away (the core then takes VBUS as valid at
/// all times) or the B-device comparator watching it. Which bits say that
/// is the part's GCCFG generation, so the value is computed here and the
/// driver writes it without asking the preprocessor anything.
constexpr uint32_t otg_gccfg_device(bool sense_vbus) {
#if defined(USB_OTG_GCCFG_NOVBUSSENS)
    return USB_OTG_GCCFG_PWRDWN |
           (sense_vbus ? USB_OTG_GCCFG_VBUSBSEN : USB_OTG_GCCFG_NOVBUSSENS);
#elif defined(USB_OTG_GCCFG_VBDEN)
    return USB_OTG_GCCFG_PWRDWN | (sense_vbus ? USB_OTG_GCCFG_VBDEN : 0u);
#else
    (void)sense_vbus;
    return 0;
#endif
}

/// GUSBCFG.TRDT for an AHB rate, RM0383 table 132 (RM0090 and RM0390 carry
/// the same table): the turnaround the core adds so a slow AHB still
/// answers an IN token in time. 0 means the rate is below the 14.2 MHz
/// floor the chapter's own caution states (RM0383 22.3.3), where no TRDT
/// value serves.
constexpr uint8_t otg_turnaround_for(uint32_t ahb_hz) {
    if (ahb_hz >= 32'000'000u) { return 0x6; }
    if (ahb_hz >= 27'500'000u) { return 0x7; }
    if (ahb_hz >= 24'000'000u) { return 0x8; }
    if (ahb_hz >= 21'800'000u) { return 0x9; }
    if (ahb_hz >= 20'000'000u) { return 0xA; }
    if (ahb_hz >= 18'500'000u) { return 0xB; }
    if (ahb_hz >= 17'200'000u) { return 0xC; }
    if (ahb_hz >= 16'000'000u) { return 0xD; }
    if (ahb_hz >= 15'000'000u) { return 0xE; }
    if (ahb_hz >= 14'200'000u) { return 0xF; }
    return 0;
}

// ---- power --------------------------------------------------------------------
//
// The regulator's own facts - the VOS width, the over-drive pair and the
// frequency ladders - are up in "the regulator and the clock ladders",
// where the clock task needs them. What is here is the rest of the PWR
// chapter: which optional fields this part's PWR_CR and PWR_CSR carry, and
// the two things the header cannot be asked for (the PVD's thresholds in
// volts, and which pad each wake-up pin is).

/// PWR_CR's under-drive field (UDEN[1:0]) and PWR_CSR's UDRDY: the
/// F42x/F43x, F446 and F469/F479 classes, the same set as the over-drive
/// pair - the two are the halves of one option.
constexpr bool pwr_has_under_drive() {
#if defined(PWR_CR_UDEN)
    return true;
#else
    return false;
#endif
}

/// PWR_CR's low-voltage-in-deep-sleep pair. RM0383 5.4.1 spells them
/// MRLVDS and LPLVDS, RM0390 5.4.1 spells the same two bits MRUDS and
/// LPUDS; ST's headers use the first spelling everywhere the bits exist,
/// which is every part but the F405/F407/F415/F417 class.
constexpr bool pwr_has_low_voltage_stop() {
#if defined(PWR_CR_MRLVDS)
    return true;
#else
    return false;
#endif
}

/// PWR_CR's FISSR and FMSSR - stopping the flash interface, or the flash
/// itself, WHILE THE SYSTEM RUNS. Absent on the F401, the F405 class and
/// the F42x/F43x; present from the F410 up and on the F446.
constexpr bool pwr_has_flash_stop_while_run() {
#if defined(PWR_CR_FISSR)
    return true;
#else
    return false;
#endif
}

/// PWR_CR.ADCDC1, the bit AN4073 owns: present everywhere but the F405
/// class.
constexpr bool pwr_has_adcdc1() {
#if defined(PWR_CR_ADCDC1)
    return true;
#else
    return false;
#endif
}

/// PWR_CSR's enable bit for wake-up pin `n` (1-based), 0 when this part
/// has no such pin. The parts with ONE pin call the bit EWUP and put it
/// at bit 8, which is exactly where the parts with several put EWUP1 - so
/// pin 1 is the same pin under both spellings, and the header's own
/// symbols answer for the rest.
constexpr uint32_t pwr_wakeup_pin_mask(uint8_t n) {
    switch (n) {
        case 1:
#if defined(PWR_CSR_EWUP1)
            return PWR_CSR_EWUP1;
#elif defined(PWR_CSR_EWUP)
            return PWR_CSR_EWUP;
#else
            return 0u;
#endif
        case 2:
#if defined(PWR_CSR_EWUP2)
            return PWR_CSR_EWUP2;
#else
            return 0u;
#endif
        case 3:
#if defined(PWR_CSR_EWUP3)
            return PWR_CSR_EWUP3;
#else
            return 0u;
#endif
        default:
            return 0u;
    }
}

