uliano/brio/brio/stm32f4/device_tables.hpp
/// How many WKUPx pins this part bonds: one on the F401, the F405 class,
/// the F411 and the F42x/F43x and F469/F479; two on the F446; three on
/// the F410, F412 and F413/F423.
constexpr uint8_t pwr_wakeup_pin_count() {
    uint8_t n = 0;
    while (n < 3u && pwr_wakeup_pin_mask(static_cast<uint8_t>(n + 1u)) != 0u) {
        ++n;
    }
    return n;
}

/**
 * Which PAD a wake-up pin is, AND THE DEVICE HEADER CANNOT BE ASKED - the
 * bonding is the datasheet's, so this is keyed on the device-select define
 * like the frequency ladders and the RTC's pads.
 *
 * WKUP1 is PA0 on every part read, and the datasheets label that pad
 * PA0-WKUP. The second pin of the F446 is PC13 (DS10693 table 11 names it
 * WKUP1 there, counting from zero where PWR_CSR's EWUP2 counts from one -
 * the register is what this file follows). A class whose datasheet is not
 * on the desk gets `known == false` for every pin past the first: an
 * enable written for a pad nobody identified would arm an input the
 * application cannot reason about.
 */
struct PwrWakeupPad {
    bool known = false;
    char port = 0;
    uint8_t pin = 0;
};

constexpr PwrWakeupPad pwr_wakeup_pad(uint8_t n) {
    PwrWakeupPad p{};
    if (pwr_wakeup_pin_mask(n) == 0u) {
        return p;
    }
    if (n == 1u) {
        // Every datasheet of this family labels the pad PA0-WKUP.
        p.known = true;
        p.port = 'A';
        p.pin = 0;
        return p;
    }
#if defined(STM32F446xx)
    if (n == 2u) {
        p.known = true;
        p.port = 'C';
        p.pin = 13;
    }
#endif
    return p;
}

/**
 * The eight PVD thresholds PLS[2:0] selects, in MILLIVOLTS - the
 * reference manual's table and not the header's, and it differs by part
 * class: RM0090 5.4.1 and 5.5.1 and RM0390 5.4.1 give 2.0, 2.1, 2.3, 2.5,
 * 2.6, 2.7, 2.8 and 2.9 V; RM0383 5.4.1 gives 2.2, 2.3, 2.4, 2.5, 2.6,
 * 2.7, 2.8 and 2.9 V. A class whose manual is not on the desk gets
 * `known == false` and no millivolts: the CODE is still writable there
 * (the field is the same three bits on every part), but what it means in
 * volts is refused rather than guessed.
 */
struct PvdLevels {
    bool known = false;
    uint16_t mv[8] = {};
};

constexpr PvdLevels pwr_pvd_levels() {
    PvdLevels l{};
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx) || \
    defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx) || \
    defined(STM32F446xx)
    l.known = true;
    l.mv[0] = 2000; l.mv[1] = 2100; l.mv[2] = 2300; l.mv[3] = 2500;
    l.mv[4] = 2600; l.mv[5] = 2700; l.mv[6] = 2800; l.mv[7] = 2900;
#elif defined(STM32F411xE)
    l.known = true;
    l.mv[0] = 2200; l.mv[1] = 2300; l.mv[2] = 2400; l.mv[3] = 2500;
    l.mv[4] = 2600; l.mv[5] = 2700; l.mv[6] = 2800; l.mv[7] = 2900;
#endif
    return l;
}

/// The EXTI line the PVD's output raises - a CONFIGURABLE line on this
/// family (RM0090 12.2.5, RM0390 11.2.5, RM0383 10.2.5), so a sense must
/// be chosen before anything is pending. Published here per the stratum's
/// rule that a peripheral owns its own line number.
inline constexpr uint8_t pwr_pvd_exti_line = 16;

/// RCC_AHB1ENR's gate on the 4 KB backup SRAM the backup regulator keeps
/// alive; 0 where the part has no backup SRAM (the F401, F410, F411 and
/// F412/F413 classes), whose PWR_CSR still carries BRE and BRR.
constexpr uint32_t pwr_backup_sram_clock_mask() {
#if defined(RCC_AHB1ENR_BKPSRAMEN)
    return RCC_AHB1ENR_BKPSRAMEN;
#else
    return 0u;
#endif
}

// ---- I2C ----------------------------------------------------------------------
//
// WHAT THE HEADER ANSWERS AND WHAT IT DOES NOT, for RM0090 ch. 27 (RM0390
// ch. 24, RM0383 ch. 18):
//  - WHICH INSTANCES EXIST, their gate and their TWO vectors: the header,
//    three ways over (I2Cn_BASE, RCC_APB1ENR_I2CnEN, I2Cn_EV_IRQn /
//    I2Cn_ER_IRQn). I2C1 and I2C2 are on every part of the pack; I2C3 is
//    absent on the F410 alone.
//  - WHICH BUS: APB1, on every instance of every part - and the question
//    is put to the enable bit's own register rather than written down as
//    a rule, exactly as spi_on_apb2() puts it.
//  - WHETHER THE NOISE FILTER REGISTER IS THERE: the header again, and it
//    is the one place this chapter varies. I2C_FLTR at offset 0x24 is
//    absent from the I2C_TypeDef of the F405 class (F405/F415/F407/F417)
//    - RM0090 27.3.5 gives the digital filter to the F42xxx and F43xxx
//    alone - and present on every other part of the pack. The STRUCT
//    FIELD is what a driver would touch and the BIT DEFINITIONS come and
//    go with it, so the presence question is put to I2C_FLTR_ANOFF, a
//    symbol the preprocessor can probe.
//  - WHERE THE DMA REQUESTS SIT: the request mapping tables, keyed per
//    part class as every other chapter's slice of them is.

constexpr uint32_t i2c_base(uint8_t n) {
    switch (n) {
#if defined(I2C1_BASE)
        case 1: return I2C1_BASE;
#endif
#if defined(I2C2_BASE)
        case 2: return I2C2_BASE;
#endif
#if defined(I2C3_BASE)
        case 3: return I2C3_BASE;
#endif
        default: return 0;
    }
}

constexpr bool i2c_present(uint8_t n) { return i2c_base(n) != 0u; }

/// Asked of the enable bit's own register: no part of this family puts an
/// I2C on APB2, and this answers false everywhere rather than saying so
/// twice.
constexpr bool i2c_on_apb2(uint8_t n) {
    switch (n) {
#if defined(RCC_APB2ENR_I2C1EN)
        case 1: return true;
#endif
#if defined(RCC_APB2ENR_I2C2EN)
        case 2: return true;
#endif
#if defined(RCC_APB2ENR_I2C3EN)
        case 3: return true;
#endif
        default: return false;
    }
}

/// The instance's enable bit; the same position resets it in RCC_APB1RSTR.
constexpr uint32_t i2c_clock_mask(uint8_t n) {
    switch (n) {
#if defined(RCC_APB1ENR_I2C1EN)
        case 1: return RCC_APB1ENR_I2C1EN;
#endif
#if defined(RCC_APB1ENR_I2C2EN)
        case 2: return RCC_APB1ENR_I2C2EN;
#endif
#if defined(RCC_APB1ENR_I2C3EN)
        case 3: return RCC_APB1ENR_I2C3EN;
#endif
        default: return 0;
    }
}

/// TWO VECTORS PER INSTANCE (27.4): the events on one, the errors on the
/// other. An IRQn is an enumerator the preprocessor cannot probe, so each
/// is guarded by its instance's base macro.
constexpr IRQn_Type i2c_event_irq(uint8_t n) {
    switch (n) {
#if defined(I2C1_BASE)
        case 1: return I2C1_EV_IRQn;
#endif
#if defined(I2C2_BASE)
        case 2: return I2C2_EV_IRQn;
#endif
#if defined(I2C3_BASE)
        case 3: return I2C3_EV_IRQn;
#endif
        default: return NonMaskableInt_IRQn;
    }
}

